yt11dev.СК/src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

yt11dev.СК/src/AccumulationRegisters/СК_ТоварыНаСкладах/СК_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СК_ТоварыНаСкладах</name>
  <resources>
    <name>Вналичии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

yt11dev.СК/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/DataProcessors/СК_МобСклад/ManagerModule.bsl
Функция ПолучитьЯчейкиПоКоличеству(Номенклатура,Количество) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	|ИЗ
	|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	|ГДЕ
	|	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВналичииОстаток";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Рез = Запрос.Выполнить().Выбрать();
	
	Мас = Новый Массив;
	Кол = 0;	
	Пока Рез.Следующий() Цикл
		СЗ = Новый Структура;           
		Сз.Вставить("Ячейка",Строка(Рез.Ячейка));
		Сз.Вставить("ВналичииОстаток",Рез.ВналичииОстаток);
		Мас.Добавить(СЗ);   
		
		Кол = Кол + Рез.ВналичииОстаток;				
		
		Если Кол >= Количество Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции


Функция ПреобразоватьМассивВТаблицуЗначений(мсДанные) Экспорт
    тзДанные = Новый ТаблицаЗначений;
    Для Каждого ЭлементМассива Из мсДанные Цикл
			Если тзДанные.Колонки.Количество() = 0 Тогда
	            Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
	                тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
	            КонецЦикла
	        КонецЕсли;
	        НоваяСтрока = тзДанные.Добавить();
	        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
	            НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
			КонецЦикла
    КонецЦикла;
    Возврат тзДанные;
КонецФункции


Функция ПолучитьОстаток(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	|ИЗ
	|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	|ГДЕ
	|	СК_ТоварыНаСкладахОстатки.Номенклатура В (&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВналичииОстаток";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;
	
КонецФункции 

Функция ПолучитьОстатокНоменклатураЯчейка(Номенклатура,Ячейка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	               |	СУММА(СК_ТоварыНаСкладахОстатки.ВналичииОстаток) КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	               |	И СК_ТоварыНаСкладахОстатки.Ячейка = СК_ТоварыНаСкладахОстатки.Ячейка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВналичииОстаток";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Запрос.УстановитьПараметр("Ячейка",Ячейка); 
	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;
	
КонецФункции  

Функция ПоискШтрихКодаПоНоменклатуре(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
|ИЗ
|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
|ГДЕ
|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
